app/Http/Controllers/FullCalenderController.php

insert into `events` (`title`, `start`, `end`, `updated_at`, `created_at`) values ('est', '2024-02-07', '2024-02-08', '2024-02-23 13:39:16', '2024-02-23 13:39:16')
select * from `events` where `events`.`id` = '1' limit 1
---
    public function ajax(Request $request): JsonResponse

    {



        switch ($request->type) {

            case 'add':

                $event = Event::create([

                    'title' => $request->title,

                    'start' => $request->start,

                    'end' => $request->end,

                ]);



                return response()->json($event);

                break;



            case 'update':

                $event = Event::find($request->id)->update([

                    'title' => $request->title,

                    'start' => $request->start,

                    'end' => $request->end,

                ]);