app/Http/Controllers/FullCalendarController.php

insert into `meetings` (`name`, `date_start`, `date_end`, `updated_at`, `created_at`) values ('salut', '2024-02-13 00:00', '2024-02-14 00:00', '2024-02-23 11:08:19', '2024-02-23 11:08:19')
select * from `meetings` where `meetings`.`id` = '11' limit 1
update `meetings` set `name` = 'event.name', `date_start` = '2024-02-26 00:00', `date_end` = '2024-02-27 00:00', `meetings`.`updated_at` = '2024-02-23 11:03:49' where `id` = 11
---
    public function ajax(Request $request): JsonResponse

    {



        switch ($request->type) {

            case 'add':

                $meeting = Meetings::create([

                    'name' => $request->name,

                    'date_start' => $request->date_start,

                    'date_end' => $request->date_end,

                ]);



                return response()->json($meeting);

                break;



            case 'update':

                $meeting = Meetings::find($request->id)->update([

                    'name' => $request->name,

                    'date_start' => $request->date_start,

                    'date_end' => $request->date_end,

                ]);